app/controllers/api_controller.rb

  def listar_anexos_grupo
    grupo = Grupo.find(params[:grupo_id])
---
SELECT  "grupos".* FROM "grupos" WHERE "grupos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def criar_grupo
    user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]