app/controllers/api_controller.rb

  def listar_grupos
    render json: {status: 200, grupos: Grupo.all.collect{|n| [n.id, n.nome, n.usuariosPermitidos]}}
---
SELECT "grupos".* FROM "grupos"

  def criar_grupo

    grupo = Grupo.create(
      nome: params[:nome],
      usuariosPermitidos: params[:usuariosPermitidos]
    )
---
INSERT INTO "grupos" ("nome", "usuariosPermitidos", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def criar_msg

    mensagem = Mensagem.create(
      grupo_id: params[:grupo_id],
      user_id: params[:user_id],
      msg: params[:msg]
    )
---
INSERT INTO "mensagems" ("user_id", "grupo_id", "msg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["grupo_id", 1], ["msg", "aasasa"], ["created_at", "2020-03-16 00:17:23.550355"], ["updated_at", "2020-03-16 00:17:23.550355"]]