app/controllers/api_controller.rb

  def login
    user = User.where(cpf: params[:cpf].get_only_digits).last
---
SELECT  "users".* FROM "users" WHERE "users"."cpf" = ? ORDER BY "users"."id" DESC LIMIT ?  [["cpf", "10215244448"], ["LIMIT", 1]]

  def criar_usuario
    if User.find(params[:user_id]).tem_permissao("criar_usuario")
      a = params[:usuario][:permissoes]
      params[:usuario][:permissoes] = "#{params[:usuario][:permissoes]}false" if a[a.size-2..a.size-1] == "||"
      params[:usuario][:permissoes] = params[:usuario][:permissoes].split("||").collect{|f| f.present? && f != "false" ? "true" : "false"}.join("||")

      user = User.create(
        cpf: params[:usuario][:cpf].get_only_digits,
        password: "123456",
        email: params[:usuario][:email],
        ativo: true,
        nome: params[:usuario][:nome],
        permissoes: params[:usuario][:permissoes],
        permissao_ids: params[:usuario][:permissoesIds]
      )
---
INSERT INTO "users" ("email", "encrypted_password", "cpf", "created_at", "updated_at", "token", "nome", "ativo") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def listar_usuarios
    render json: {status: 200, usuarios: User.all.collect{|n| [n.id, n.nome, n.email, n.cpf, n.ativo, n.permissoes]}}
---
SELECT "users".* FROM "users"

  def get_usuario
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update_usuario
    if User.find(params[:user_id]).tem_permissao("editar_usuario")
      user = User.find(params[:id])

      permsId = params[:permissoes]
      params[:permissoes] = params[:permissoesIds]
      params[:permissoesIds] = permsId

      a = params[:permissoes]
      params[:permissoes] = "#{params[:permissoes]}false" if a[a.size-2..a.size-1] == "||"
      params[:permissoes] = params[:permissoes].split("||").collect{|f| f.present? && f != "false" ? "true" : "false"}.join("||")
      user.update_attributes(nome: params[:nome], email: params[:email], cpf: params[:cpf], ativo: params[:ativo], permissoes: params[:permissoes], permissao_ids: params[:permissoesIds])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "semoddgs@gseg.com"], ["updated_at", "2020-03-13 12:34:05.819451"], ["id", 2]]

  def listar_anexos_grupo
    grupo = Grupo.find(params[:grupo_id])
---
SELECT  "grupos".* FROM "grupos" WHERE "grupos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def criar_grupo
    user = User.find(params[:user_id])
    if user && user.tem_permissao("criar_grupo")
      grupo = Grupo.create(
        nome: params[:grupo][:nome],
        usuarios_permitidos: params[:grupo][:usuariosPermitidos],
        user_id: user.id
      )
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "grupos" ("nome", "usuariosPermitidos", "created_at", "updated_at") VALUES (?, ?, ?, ?)

  def criar_msg
    mensagem = Mensagem.create(
      grupo_id: params[:grupo_id],
      user_id: params[:user_id],
      msg: params[:msg],
      tipo: "msg"
    )
---
INSERT INTO "mensagems" ("user_id", "grupo_id", "msg", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["grupo_id", 1], ["msg", "aasasa"], ["created_at", "2020-03-16 00:17:23.550355"], ["updated_at", "2020-03-16 00:17:23.550355"]]

  def set_user_onesignal
    user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]